import random

LOXI = ["Тёма", "Наська", "Катюха"]  # список
LOX_INVEN = {
    "Тёма": "Смертельные объятия, " "штаны парашюты, " "ноут",
    "Наська": "Жвачка, " "телефон",
    "Катюха": "Документация по С#, " "фонарь, " "фантик, " "журнал"
}  # словарь
game = True


def TEMA():
    print("Не повезло ему оказаться в трэп-хате банана...\n"
          "В холодильнике 3 бутылки молока стоявшие несколько месяцев и давно скисли. Прочие продукты тоже сгнили.\n"
          "Под кроватью в спальне лежит прованый презерватив и пояс верности.\n"
          "- Ох зря я сюда полез... - чуть не плача сказал Тёма, глаза слезились, но из-за вони.\n"
          "- Надо выбираться, пока меня не накуканил банан!!!")
    while True:
        try:
            choose = int(input("Выберите, что будет делать Тёма:\n\t"
                               "1. Плакать\n\t"
                               "2. Дождётся банана и использует на нём смертельные объятия\n\t"
                               "3. Оценит расстояние от окна до земли\n\t"
                               "4. Будет писать ультра-код на spring\n"
                               "Вариант: "))
            if (choose == 0 or choose > 4):
                print("Такого варианте не существует, выберите заново!")
                continue
        except ValueError:
            print("Число напиши, дЭб1L!".upper())
            continue
        match choose:
            case 1:
                print("Удивительно, но такой стойкий человек не выдержал напряжения\n"
                      "и давящей атмосферы данного помещения и разревелся как девчонка!")
                TEMAcry()
                return
            case 2:
                print("))")
            case 3:
                print("))")
            case 4:
                print("))")
    return


def NASKA():
    print("")
    return


def KATUXA():
    print("")
    return


def TEMAcry():
    chanse = random.randint(0,1)
    match chanse:
        case 0:
            print("Тёму накуканил банан, ВЫ ПРОИГРАЛИ!")
        case 1:
            print("Плач этого кита услышали соседи и вызвали 112, Тёму спасли, ПОБЕДА!!!")


print("Вы заспустили НОВЕЛЛУ \"Побег от банана с обосранной жэпой\"..."  # экранирование строки
      "В N-городе завёлся мама-ама-криминал, которого прозвали \"БАНАН\"\n"
      "и так уж вышло, что его штаны, в которых он вершил грязные делишки, были обосраны. Всегда...\n"
      "На прошлой неделе он совершил ряд нападений на граждан РФ и притащил их в свою трэп-хату.\n"
      "Вам предстоит выбрать лоха, за которого Вы будете убегать."
      f"Так называемые лохи:\n\t1. {LOXI[0]}\n\t2. {LOXI[1]}\n\t3. {LOXI[2]}") #f-строка

while (game != False):
    try:
        LOX = int(input("Выберите лоха: "))
        if (LOX == 0 or LOX > 3):
            print("Такого варианте не существует, выберите заново!")
            continue
    except ValueError:
        print("Число напиши, дЭб1L!".upper())
        continue

    match LOX:
          case 1:
              print("Тёма: мама-java под 2 метра.\n"
                    "Характеристика: \"Лучший среди худших\", прямолинеен.\n"
                    "Говнокод = криптонит.\n"
                    "Характер скверный.\n"
                    "Не женат.\n"
                    f'Предметы: {LOX_INVEN["Тёма"]}')
              choice = str(input(f"Сбежать за: {LOXI[0]}? (Да/Нет): ")).upper()
              match choice:
                      case "ДА":
                          TEMA()
                          game = False
                          print("Спасибо за прохождение!")
                      case "НЕТ":
                          print("- Ты офигело? Быдло.")
                          continue
                      case _:
                          print("Выберите заново...")
          case 2:
              print("Наська: золотые руки, плохая память и говнокод - незыблимые факты.\n"
                    "Характеристика: Яркая личность, немного кринжа и сумасшествия.\n"
                    "Чаще всего описывается людьми, как милый ксёк либо е******я ****.\n"
                    "На всё в жизни реагирует так, словно подобное дерьмо уже часть её ежедневного расписания, что отчасти является правдой.\n"
                    "Характер пойдёт (КУДА?????????).\n"
                    f'Предметы: {LOX_INVEN["Наська"]}')
              choice = str(input(f"Сбежать за: {LOXI[1]}? (Да/Нет): ")).upper()
              match choice:
                    case "ДА":
                        NASKA()
                        game = False
                        print("Спасибо за прохождение!")
                    case "НЕТ":
                        print("- Я НЕ ХОЧУ УМИРАТЬ!!!!!!")
                        continue
                    case _:
                        print("Выберите заново...")
          case 3:
              print("Катюха: КРУГЛАЯ отличница ))ООО)))О)ОО.\n"
                    "Характеристика: Слишком умная для этой ситуации.\n"
                    "С осторожностью подходит к любым задачам.\n"  # добавить подтверждение каждого выбора, можно вынести в отдельную функу
                    "Любит ксёков.\n"
                    "Характер с переменным успехом.\n"
                    f'Предметы: {LOX_INVEN["Катюха"]}')
              choice = str(input(f"Сбежать за: {LOXI[2]}? (Да/Нет): ")).upper()
              match choice:
                    case "ДА":
                        KATUXA()
                        game = False
                        print("Спасибо за прохождение!")
                    case "НЕТ":
                        print("- Упаси Боже.")
                        continue
                    case _:
                        print("Выберите заново...")